src/cf/Catalogs/fmCashflowItems.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmCashflowItems</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>fmAnalyticsType1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.fmAnalyticsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fmAnalyticsType2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.fmAnalyticsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fmAnalyticsType3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.fmAnalyticsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fmItemType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetFlowOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>fmEntriesTemplates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>AccountDr</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.fmBudgeting</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountCr</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.fmBudgeting</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountCalculationRatio</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionDr1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionDr2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionDr3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionCr1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionCr2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionCr3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/fmCashflowItems/Forms/ItemForm/Ext/Form/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	//fm rarus begin
	TemporaryModule.OnCreateAtServer(ThisForm);
	fmBudgeting.OnCreateAtServerProcessTemplateEntriesTable(Object, TSAttributes);
	//fm rarus end
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, RecordParameters)
	
	// fm rarus begin
	fmBudgeting.BeforeWriteAtServerProcessTemplateEntriesTable(Object, CurrentObject);
	// fm rarus end
	
EndProcedure

#EndRegion

&AtClient
Procedure EntriesTemplateChooseFromListStart(Item)
	fmBudgetingClientServer.RepresentList(ThisForm, Item);
EndProcedure

&AtClient
Procedure EntriesTemplatesExtDimensionDrOnChange(Item)
	CurrentData = Items.EntriesTemplates.CurrentData;
	AccountExtDimensions = fmBudgeting.GetAccountExtDimension(CurrentData.AccountDr);
	fmBudgetingClientServer.CheckTypesMap(Object,"ExtDimensionDr", AccountExtDimensions, CurrentData, Item.Name);
EndProcedure

&AtClient
Procedure EntriesTemplatesExtDimensionCrOnChange(Item)
	CurrentData = Items.EntriesTemplates.CurrentData;
	AccountExtDimensions = fmBudgeting.GetAccountExtDimension(CurrentData.AccountCr);
	fmBudgetingClientServer.CheckTypesMap(Object,"ExtDimensionCr", AccountExtDimensions, CurrentData, Item.Name);
EndProcedure

&AtClient
Procedure EntriesTemplatesAccountDrOnChange(Item)
	CurRow = Items.EntriesTemplates.CurrentData;
	AnalyticsTypes = fmBudgeting.GetAccountExtDimension(CurRow.AccountDr);
	Index = 1;
	For Each It1 In AnalyticsTypes Do
		If TypeOf(It1.Value) <> Type("Boolean") Then
			CurRow["fmAnalyticsTypeDr"+Index] = It1.Value;
			CurRow["ExtDimensionDr"+Index] = Undefined;
			Index = Index+1;
		EndIf;
	EndDo;
EndProcedure

&AtClient
Procedure EntriesTemplatesAccountCrOnChange(Item)
	CurRow = Items.EntriesTemplates.CurrentData;
	AnalyticsTypes = fmBudgeting.GetAccountExtDimension(CurRow.AccountCr);
	Index = 1;
	For Each It1 In AnalyticsTypes Do
		If TypeOf(It1.Value) <> Type("Boolean") Then
			CurRow["fmAnalyticsTypeCr"+Index] = It1.Value;
			CurRow["ExtDimensionCr"+Index] = Undefined;
			Index = Index+1;
		EndIf;
	EndDo;
EndProcedure

&AtClient
Procedure TypeItemStartChoice(Item, ChoiceData, StandardProcessing)
	StandardProcessing = False;
EndProcedure

&AtClient
Procedure EntriesTemplatesOnStartEdit(Item, NewLine, Copy)
	If NewLine AND NOT Copy Then
		Item.CurrentData.AmountCalculationRatio = 1;
	EndIf;
EndProcedure

&AtClient
Procedure OnActivateCellEntriesTemplates(Item)
	fmBudgetingClientServer.RepresentList(ThisForm, Item);
EndProcedure
